; domain
(define (domain healthcare)

(:requirements :strips :typing :negative-preconditions :universal-preconditions)

(:types
	location
	unit - locatable
	content - locatable
	box - locatable
	patient - locatable
	robot-box - robot
	robot-patient - robot
	robot - locatable
)

(:constants 
	central_warehouse - location
	entrance - location
	scalpel tongue_depressor aspirin bandage thermometer - content
)

(:predicates
	(at ?x - locatable ?l - location)			; x is at location
	(connected ?l1 - location ?l2 - location)	; locations are connected
	
	(loaded ?r - robot ?b - box)          		; robot is carrying a box
	(unloaded ?r - robot-box)               	; robot is empty
	(empty-box ?b - box)               			; box is empty
	(filled-with ?b - box ?c - content) 		; box is filled with content 
	(unit-has-box ?u - unit ?b - box)           ; unit has a box
	(unit-has-content ?u - unit ?c - content) 	; unit has specific content
	
	(with-patient ?r - robot ?p - patient)     	; robot is with a patient
	(busy ?r - robot-patient)           		; robot is busy with a patient
	(at-unit ?p - patient ?u - unit) 			; patient is at unit
)


; (:functions)


; Both robot-box and robot-patient can move between connected locations
(:action move
	:parameters (?r - robot ?from - location ?to - location)
	:precondition (and 
		(at ?r ?from)
		(or (connected ?from ?to) (connected ?to ?from))
	)
	:effect (and 
		(at ?r ?to)
		(not (at ?r ?from))

		; we don't need to update the location of the carried box or patient
		; it is updated once it is delivered or released
		; (forall (?b - box) 
		; 	(when (loaded ?r ?b) 
		; 		(and (at ?b ?to)
		; 			(not (at ?b ?from))
		; 		)
		; 	)
		; )

		; (forall (?p - patient) 
		; 	(when (with-patient ?r ?p) 
		; 		(and (at ?p ?to)
		; 			(not (at ?p ?from))
		; 		)
		; 	)
		; )
	)
)

; Robot-box can fill a box with content
(:action fill
	:parameters (?r - robot-box ?b - box ?c - content ?l - location)
	:precondition (and 
		(at ?b ?l)
		(at ?r ?l)
		(at ?c ?l)
		(empty-box ?b)
		(= ?l central_warehouse) ; content can only be filled in the central warehouse
	)
	:effect (and 
		(filled-with ?b ?c)
		(not (empty-box ?b))
	)
)

; Robot-box can empty a box filled with content causing the unit to have that content
(:action empty
	:parameters (?r - robot-box ?b - box ?c - content ?u - unit ?l - location)
	:precondition (and 
		(at ?u ?l)
		(at ?b ?l)
		(at ?r ?l)
		(unit-has-box ?u ?b)
		(filled-with ?b ?c)
		; (not (empty-box ?b))					; redundant
		; (not (unit-has-content ?u ?c))			; necessary?
	)
	:effect (and 
		(unit-has-content ?u ?c)
		(not (filled-with ?b ?c))
		(empty-box ?b)
		(at ?c ?l)
	)
)

; Robot-box can pick up a box from a location
(:action pick-up
	:parameters (?r - robot-box ?b - box ?l - location)
	:precondition (and 
		(at ?b ?l)
		(at ?r ?l)
		(unloaded ?r)
	)
	:effect (and 
		(loaded ?r ?b)
		(not (unloaded ?r))
		(not (at ?b ?l))
	)
)


; Robot-box can deliver a box to a unit at a location
(:action deliver
		:parameters (?r - robot-box ?b - box ?l - location ?u - unit)
		:precondition (and
			(at ?r ?l)
			(at ?u ?l)

			(loaded ?r ?b)
		)
		:effect (and 
			(at ?b ?l)
			(unit-has-box ?u ?b)
			
			(not (loaded ?r ?b))
			(unloaded ?r)
		)
)

; Robot-patient can take a patient from a location, causing the robot to be busy
(:action take-patient
	:parameters (?r - robot-patient ?p - patient ?l - location)
	:precondition (and 
		(at ?r ?l)
		(at ?p ?l)
		(not (busy ?r))
	)
	:effect (and 
		(with-patient ?r ?p)
		(busy ?r)
	)
)

; Robot-patient can release a patient at a location, causing the robot to be no longer busy
(:action release-patient
	:parameters (?r - robot-patient ?p - patient ?l - location ?u - unit)
	:precondition (and 
		(at ?r ?l)
		(at ?u ?l)

		(with-patient ?r ?p)
		(busy ?r)
	)

	:effect (and 
		(at ?p ?l)
		(at-unit ?p ?u)
		
		(not (with-patient ?r ?p))
		(not (busy ?r))
	)
)
)

; problem
(define (problem problem1) (:domain healthcare)
(:objects 
    r1 - robot-box
    r2 - robot-patient
    
    b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 - box
    c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 - content

    u1 u2 u3 - unit
    l1 l2 - location

    p1 - patient
)

(:init
    (at b1 central_warehouse)
    (at b2 central_warehouse)
    (at b3 central_warehouse)
    (at b4 central_warehouse)
    (at b5 central_warehouse)
    (at b6 central_warehouse)
    (at b7 central_warehouse)
    (at b8 central_warehouse)
    (at b9 central_warehouse)
    (at b10 central_warehouse)
    (at b11 central_warehouse)
    (at b12 central_warehouse)
    (at b13 central_warehouse)
    (at b14 central_warehouse)
    (at b15 central_warehouse)
    (at b16 central_warehouse)
    (at b17 central_warehouse)
    (at b18 central_warehouse)
    (at b19 central_warehouse)
    (at b20 central_warehouse)


    (empty-box b1)
    (empty-box b2)
    (empty-box b3)
    (empty-box b4)
    (empty-box b5)
    (empty-box b6)
    (empty-box b7)
    (empty-box b8)
    (empty-box b9)
    (empty-box b10)
    (empty-box b11)
    (empty-box b12)
    (empty-box b13)
    (empty-box b14)
    (empty-box b15)
    (empty-box b16)
    (empty-box b17)
    (empty-box b18)
    (empty-box b19)
    (empty-box b20)

    (at tongue_depressor central_warehouse)
    (at scalpel central_warehouse)

    (at c1 central_warehouse)
    (at c2 central_warehouse)
    (at c3 central_warehouse)
    (at c4 central_warehouse)
    (at c5 central_warehouse)
    (at c6 central_warehouse)
    (at c7 central_warehouse)
    (at c8 central_warehouse)
    (at c9 central_warehouse)
    (at c10 central_warehouse)

    (at u1 l1)
    (at u2 l2)
    (at u3 l2)

    (at r1 central_warehouse)
    (at r2 entrance)

    (unloaded r1)
    ; not (busy r2)         not needed, in STRIPS they are false by default if not specified

    (at p1 entrance)
    
    (connected entrance l1)
    (connected l1 l2)
    (connected l2 central_warehouse)
)

(:goal (and
    (unit-has-content u1 c1)
    (unit-has-content u1 c2)
    (unit-has-content u1 c3)
    (unit-has-content u1 c4)
    (unit-has-content u1 c5)
    (unit-has-content u1 c6)
    (unit-has-content u1 c7)
    (unit-has-content u1 c8)
    (unit-has-content u1 c9)
    (unit-has-content u1 c10)

    (unit-has-content u2 c1)
    (unit-has-content u2 c2)
    (unit-has-content u2 c3)
    (unit-has-content u2 c4)
    (unit-has-content u2 c5)
    (unit-has-content u2 c6)
    (unit-has-content u2 c7)
    (unit-has-content u2 c8)
    (unit-has-content u2 c9)
    (unit-has-content u2 c10)

    (at-unit p1 u1)
))

)

; plan
1. (take-patient r2 p1 entrance)
   added: (with-patient r2 p1) (busy r2)
   goals met: 0 of 21
2. (move r2 entrance l1)
   deleted: (at r2 entrance)
   added: (at r2 l1)
   goals met: 0 of 21
3. (release-patient r2 p1 l1 u1)
   deleted: (with-patient r2 p1) (busy r2)
   added: (at p1 l1) (at-unit p1 u1)
   goals met: 1 of 21
4. (fill r1 b20 c1 central_warehouse)
   deleted: (empty-box b20)
   added: (filled-with b20 c1)
   goals met: 1 of 21
5. (pick-up r1 b20 central_warehouse)
   deleted: (unloaded r1) (at b20 central_warehouse)
   added: (loaded r1 b20)
   goals met: 1 of 21
6. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 1 of 21
7. (deliver r1 b20 l2 u2)
   deleted: (loaded r1 b20)
   added: (at b20 l2) (unit-has-box u2 b20) (unloaded r1)
   goals met: 1 of 21
8. (empty r1 b20 c1 u2 l2)
   deleted: (filled-with b20 c1)
   added: (unit-has-content u2 c1) (empty-box b20) (at c1 l2)
   goals met: 2 of 21
9. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 2 of 21
10. (fill r1 b19 c1 central_warehouse)
   deleted: (empty-box b19)
   added: (filled-with b19 c1)
   goals met: 2 of 21
11. (pick-up r1 b19 central_warehouse)
   deleted: (unloaded r1) (at b19 central_warehouse)
   added: (loaded r1 b19)
   goals met: 2 of 21
12. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 2 of 21
13. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 2 of 21
14. (deliver r1 b19 l1 u1)
   deleted: (loaded r1 b19)
   added: (at b19 l1) (unit-has-box u1 b19) (unloaded r1)
   goals met: 2 of 21
15. (empty r1 b19 c1 u1 l1)
   deleted: (filled-with b19 c1)
   added: (unit-has-content u1 c1) (empty-box b19) (at c1 l1)
   goals met: 3 of 21
16. (move r1 l1 l2)
   deleted: (at r1 l1)
   added: (at r1 l2)
   goals met: 3 of 21
17. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 3 of 21
18. (fill r1 b18 c2 central_warehouse)
   deleted: (empty-box b18)
   added: (filled-with b18 c2)
   goals met: 3 of 21
19. (pick-up r1 b18 central_warehouse)
   deleted: (unloaded r1) (at b18 central_warehouse)
   added: (loaded r1 b18)
   goals met: 3 of 21
20. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 3 of 21
21. (deliver r1 b18 l2 u2)
   deleted: (loaded r1 b18)
   added: (at b18 l2) (unit-has-box u2 b18) (unloaded r1)
   goals met: 3 of 21
22. (empty r1 b18 c2 u2 l2)
   deleted: (filled-with b18 c2)
   added: (unit-has-content u2 c2) (empty-box b18) (at c2 l2)
   goals met: 4 of 21
23. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 4 of 21
24. (fill r1 b17 c2 central_warehouse)
   deleted: (empty-box b17)
   added: (filled-with b17 c2)
   goals met: 4 of 21
25. (pick-up r1 b17 central_warehouse)
   deleted: (unloaded r1) (at b17 central_warehouse)
   added: (loaded r1 b17)
   goals met: 4 of 21
26. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 4 of 21
27. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 4 of 21
28. (deliver r1 b17 l1 u1)
   deleted: (loaded r1 b17)
   added: (at b17 l1) (unit-has-box u1 b17) (unloaded r1)
   goals met: 4 of 21
29. (empty r1 b17 c2 u1 l1)
   deleted: (filled-with b17 c2)
   added: (unit-has-content u1 c2) (empty-box b17) (at c2 l1)
   goals met: 5 of 21
30. (move r1 l1 l2)
   deleted: (at r1 l1)
   added: (at r1 l2)
   goals met: 5 of 21
31. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 5 of 21
32. (fill r1 b16 c3 central_warehouse)
   deleted: (empty-box b16)
   added: (filled-with b16 c3)
   goals met: 5 of 21
33. (pick-up r1 b16 central_warehouse)
   deleted: (unloaded r1) (at b16 central_warehouse)
   added: (loaded r1 b16)
   goals met: 5 of 21
34. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 5 of 21
35. (deliver r1 b16 l2 u2)
   deleted: (loaded r1 b16)
   added: (at b16 l2) (unit-has-box u2 b16) (unloaded r1)
   goals met: 5 of 21
36. (empty r1 b16 c3 u2 l2)
   deleted: (filled-with b16 c3)
   added: (unit-has-content u2 c3) (empty-box b16) (at c3 l2)
   goals met: 6 of 21
37. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 6 of 21
38. (fill r1 b15 c3 central_warehouse)
   deleted: (empty-box b15)
   added: (filled-with b15 c3)
   goals met: 6 of 21
39. (pick-up r1 b15 central_warehouse)
   deleted: (unloaded r1) (at b15 central_warehouse)
   added: (loaded r1 b15)
   goals met: 6 of 21
40. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 6 of 21
41. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 6 of 21
42. (deliver r1 b15 l1 u1)
   deleted: (loaded r1 b15)
   added: (at b15 l1) (unit-has-box u1 b15) (unloaded r1)
   goals met: 6 of 21
43. (empty r1 b15 c3 u1 l1)
   deleted: (filled-with b15 c3)
   added: (unit-has-content u1 c3) (empty-box b15) (at c3 l1)
   goals met: 7 of 21
44. (move r1 l1 l2)
   deleted: (at r1 l1)
   added: (at r1 l2)
   goals met: 7 of 21
45. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 7 of 21
46. (fill r1 b14 c4 central_warehouse)
   deleted: (empty-box b14)
   added: (filled-with b14 c4)
   goals met: 7 of 21
47. (pick-up r1 b14 central_warehouse)
   deleted: (unloaded r1) (at b14 central_warehouse)
   added: (loaded r1 b14)
   goals met: 7 of 21
48. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 7 of 21
49. (deliver r1 b14 l2 u2)
   deleted: (loaded r1 b14)
   added: (at b14 l2) (unit-has-box u2 b14) (unloaded r1)
   goals met: 7 of 21
50. (empty r1 b14 c4 u2 l2)
   deleted: (filled-with b14 c4)
   added: (unit-has-content u2 c4) (empty-box b14) (at c4 l2)
   goals met: 8 of 21
51. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 8 of 21
52. (fill r1 b13 c4 central_warehouse)
   deleted: (empty-box b13)
   added: (filled-with b13 c4)
   goals met: 8 of 21
53. (pick-up r1 b13 central_warehouse)
   deleted: (unloaded r1) (at b13 central_warehouse)
   added: (loaded r1 b13)
   goals met: 8 of 21
54. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 8 of 21
55. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 8 of 21
56. (deliver r1 b13 l1 u1)
   deleted: (loaded r1 b13)
   added: (at b13 l1) (unit-has-box u1 b13) (unloaded r1)
   goals met: 8 of 21
57. (empty r1 b13 c4 u1 l1)
   deleted: (filled-with b13 c4)
   added: (unit-has-content u1 c4) (empty-box b13) (at c4 l1)
   goals met: 9 of 21
58. (move r1 l1 l2)
   deleted: (at r1 l1)
   added: (at r1 l2)
   goals met: 9 of 21
59. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 9 of 21
60. (fill r1 b12 c5 central_warehouse)
   deleted: (empty-box b12)
   added: (filled-with b12 c5)
   goals met: 9 of 21
61. (pick-up r1 b12 central_warehouse)
   deleted: (unloaded r1) (at b12 central_warehouse)
   added: (loaded r1 b12)
   goals met: 9 of 21
62. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 9 of 21
63. (deliver r1 b12 l2 u2)
   deleted: (loaded r1 b12)
   added: (at b12 l2) (unit-has-box u2 b12) (unloaded r1)
   goals met: 9 of 21
64. (empty r1 b12 c5 u2 l2)
   deleted: (filled-with b12 c5)
   added: (unit-has-content u2 c5) (empty-box b12) (at c5 l2)
   goals met: 10 of 21
65. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 10 of 21
66. (fill r1 b11 c5 central_warehouse)
   deleted: (empty-box b11)
   added: (filled-with b11 c5)
   goals met: 10 of 21
67. (pick-up r1 b11 central_warehouse)
   deleted: (unloaded r1) (at b11 central_warehouse)
   added: (loaded r1 b11)
   goals met: 10 of 21
68. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 10 of 21
69. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 10 of 21
70. (deliver r1 b11 l1 u1)
   deleted: (loaded r1 b11)
   added: (at b11 l1) (unit-has-box u1 b11) (unloaded r1)
   goals met: 10 of 21
71. (empty r1 b11 c5 u1 l1)
   deleted: (filled-with b11 c5)
   added: (unit-has-content u1 c5) (empty-box b11) (at c5 l1)
   goals met: 11 of 21
72. (move r1 l1 l2)
   deleted: (at r1 l1)
   added: (at r1 l2)
   goals met: 11 of 21
73. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 11 of 21
74. (fill r1 b10 c6 central_warehouse)
   deleted: (empty-box b10)
   added: (filled-with b10 c6)
   goals met: 11 of 21
75. (pick-up r1 b10 central_warehouse)
   deleted: (unloaded r1) (at b10 central_warehouse)
   added: (loaded r1 b10)
   goals met: 11 of 21
76. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 11 of 21
77. (deliver r1 b10 l2 u2)
   deleted: (loaded r1 b10)
   added: (at b10 l2) (unit-has-box u2 b10) (unloaded r1)
   goals met: 11 of 21
78. (empty r1 b10 c6 u2 l2)
   deleted: (filled-with b10 c6)
   added: (unit-has-content u2 c6) (empty-box b10) (at c6 l2)
   goals met: 12 of 21
79. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 12 of 21
80. (fill r1 b9 c6 central_warehouse)
   deleted: (empty-box b9)
   added: (filled-with b9 c6)
   goals met: 12 of 21
81. (pick-up r1 b9 central_warehouse)
   deleted: (unloaded r1) (at b9 central_warehouse)
   added: (loaded r1 b9)
   goals met: 12 of 21
82. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 12 of 21
83. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 12 of 21
84. (deliver r1 b9 l1 u1)
   deleted: (loaded r1 b9)
   added: (at b9 l1) (unit-has-box u1 b9) (unloaded r1)
   goals met: 12 of 21
85. (empty r1 b9 c6 u1 l1)
   deleted: (filled-with b9 c6)
   added: (unit-has-content u1 c6) (empty-box b9) (at c6 l1)
   goals met: 13 of 21
86. (move r1 l1 l2)
   deleted: (at r1 l1)
   added: (at r1 l2)
   goals met: 13 of 21
87. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 13 of 21
88. (fill r1 b8 c7 central_warehouse)
   deleted: (empty-box b8)
   added: (filled-with b8 c7)
   goals met: 13 of 21
89. (pick-up r1 b8 central_warehouse)
   deleted: (unloaded r1) (at b8 central_warehouse)
   added: (loaded r1 b8)
   goals met: 13 of 21
90. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 13 of 21
91. (deliver r1 b8 l2 u2)
   deleted: (loaded r1 b8)
   added: (at b8 l2) (unit-has-box u2 b8) (unloaded r1)
   goals met: 13 of 21
92. (empty r1 b8 c7 u2 l2)
   deleted: (filled-with b8 c7)
   added: (unit-has-content u2 c7) (empty-box b8) (at c7 l2)
   goals met: 14 of 21
93. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 14 of 21
94. (fill r1 b7 c7 central_warehouse)
   deleted: (empty-box b7)
   added: (filled-with b7 c7)
   goals met: 14 of 21
95. (pick-up r1 b7 central_warehouse)
   deleted: (unloaded r1) (at b7 central_warehouse)
   added: (loaded r1 b7)
   goals met: 14 of 21
96. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 14 of 21
97. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 14 of 21
98. (deliver r1 b7 l1 u1)
   deleted: (loaded r1 b7)
   added: (at b7 l1) (unit-has-box u1 b7) (unloaded r1)
   goals met: 14 of 21
99. (empty r1 b7 c7 u1 l1)
   deleted: (filled-with b7 c7)
   added: (unit-has-content u1 c7) (empty-box b7) (at c7 l1)
   goals met: 15 of 21
100. (move r1 l1 l2)
   deleted: (at r1 l1)
   added: (at r1 l2)
   goals met: 15 of 21
101. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 15 of 21
102. (fill r1 b6 c8 central_warehouse)
   deleted: (empty-box b6)
   added: (filled-with b6 c8)
   goals met: 15 of 21
103. (pick-up r1 b6 central_warehouse)
   deleted: (unloaded r1) (at b6 central_warehouse)
   added: (loaded r1 b6)
   goals met: 15 of 21
104. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 15 of 21
105. (deliver r1 b6 l2 u2)
   deleted: (loaded r1 b6)
   added: (at b6 l2) (unit-has-box u2 b6) (unloaded r1)
   goals met: 15 of 21
106. (empty r1 b6 c8 u2 l2)
   deleted: (filled-with b6 c8)
   added: (unit-has-content u2 c8) (empty-box b6) (at c8 l2)
   goals met: 16 of 21
107. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 16 of 21
108. (fill r1 b5 c8 central_warehouse)
   deleted: (empty-box b5)
   added: (filled-with b5 c8)
   goals met: 16 of 21
109. (pick-up r1 b5 central_warehouse)
   deleted: (unloaded r1) (at b5 central_warehouse)
   added: (loaded r1 b5)
   goals met: 16 of 21
110. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 16 of 21
111. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 16 of 21
112. (deliver r1 b5 l1 u1)
   deleted: (loaded r1 b5)
   added: (at b5 l1) (unit-has-box u1 b5) (unloaded r1)
   goals met: 16 of 21
113. (empty r1 b5 c8 u1 l1)
   deleted: (filled-with b5 c8)
   added: (unit-has-content u1 c8) (empty-box b5) (at c8 l1)
   goals met: 17 of 21
114. (move r1 l1 l2)
   deleted: (at r1 l1)
   added: (at r1 l2)
   goals met: 17 of 21
115. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 17 of 21
116. (fill r1 b4 c9 central_warehouse)
   deleted: (empty-box b4)
   added: (filled-with b4 c9)
   goals met: 17 of 21
117. (pick-up r1 b4 central_warehouse)
   deleted: (unloaded r1) (at b4 central_warehouse)
   added: (loaded r1 b4)
   goals met: 17 of 21
118. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 17 of 21
119. (deliver r1 b4 l2 u2)
   deleted: (loaded r1 b4)
   added: (at b4 l2) (unit-has-box u2 b4) (unloaded r1)
   goals met: 17 of 21
120. (empty r1 b4 c9 u2 l2)
   deleted: (filled-with b4 c9)
   added: (unit-has-content u2 c9) (empty-box b4) (at c9 l2)
   goals met: 18 of 21
121. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 18 of 21
122. (fill r1 b3 c9 central_warehouse)
   deleted: (empty-box b3)
   added: (filled-with b3 c9)
   goals met: 18 of 21
123. (fill r1 b2 c10 central_warehouse)
   deleted: (empty-box b2)
   added: (filled-with b2 c10)
   goals met: 18 of 21
124. (pick-up r1 b3 central_warehouse)
   deleted: (unloaded r1) (at b3 central_warehouse)
   added: (loaded r1 b3)
   goals met: 18 of 21
125. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 18 of 21
126. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 18 of 21
127. (deliver r1 b3 l1 u1)
   deleted: (loaded r1 b3)
   added: (at b3 l1) (unit-has-box u1 b3) (unloaded r1)
   goals met: 18 of 21
128. (empty r1 b3 c9 u1 l1)
   deleted: (filled-with b3 c9)
   added: (unit-has-content u1 c9) (empty-box b3) (at c9 l1)
   goals met: 19 of 21
129. (move r1 l1 l2)
   deleted: (at r1 l1)
   added: (at r1 l2)
   goals met: 19 of 21
130. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 19 of 21
131. (pick-up r1 b2 central_warehouse)
   deleted: (unloaded r1) (at b2 central_warehouse)
   added: (loaded r1 b2)
   goals met: 19 of 21
132. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 19 of 21
133. (deliver r1 b2 l2 u2)
   deleted: (loaded r1 b2)
   added: (at b2 l2) (unit-has-box u2 b2) (unloaded r1)
   goals met: 19 of 21
134. (empty r1 b2 c10 u2 l2)
   deleted: (filled-with b2 c10)
   added: (unit-has-content u2 c10) (empty-box b2) (at c10 l2)
   goals met: 20 of 21
135. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 20 of 21
136. (fill r1 b1 c10 central_warehouse)
   deleted: (empty-box b1)
   added: (filled-with b1 c10)
   goals met: 20 of 21
137. (pick-up r1 b1 central_warehouse)
   deleted: (unloaded r1) (at b1 central_warehouse)
   added: (loaded r1 b1)
   goals met: 20 of 21
138. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 20 of 21
139. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 20 of 21
140. (deliver r1 b1 l1 u1)
   deleted: (loaded r1 b1)
   added: (at b1 l1) (unit-has-box u1 b1) (unloaded r1)
   goals met: 20 of 21
141. (empty r1 b1 c10 u1 l1)
   deleted: (filled-with b1 c10)
   added: (unit-has-content u1 c10) (empty-box b1) (at c10 l1)
   goals met: 21 of 21
